hiGepi/STM32F746G-Voice_recorder/Voice_recorder/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "fatfs.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32746g_discovery_lcd.h"
#include "stm32746g_discovery_ts.h"
#include "stm32746g_discovery_audio.h"
#include "stdio.h"
#include "math.h"
#include <string.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

#define ARBG8888_BYTE_PER_PIXEL   4

// SDRAM
#define SDRAM_WRITE_READ_ADDR        ((uint32_t)(LCD_FB_START_ADDRESS + (RK043FN48H_WIDTH * RK043FN48H_HEIGHT * ARBG8888_BYTE_PER_PIXEL)))

#define SDRAM_WRITE_READ_ADDR_OFFSET ((uint32_t)0x0800)
#define SRAM_WRITE_READ_ADDR_OFFSET  SDRAM_WRITE_READ_ADDR_OFFSET

// Audio
#define AUDIO_REC_START_ADDR         SDRAM_WRITE_READ_ADDR

#define AUDIO_BLOCK_SIZE   	((uint32_t)512)
#define AUDIO_BUFFER_IN    	AUDIO_REC_START_ADDR     /* In SDRAM */
#define AUDIO_BUFFER_OUT   	(AUDIO_REC_START_ADDR + (AUDIO_BLOCK_SIZE*2)) /* In SDRAM */
#define AUDIO_BUFFER_R   	(AUDIO_REC_START_ADDR + (AUDIO_BLOCK_SIZE*4))
#define AUDIO_BUFFER_L   	(AUDIO_REC_START_ADDR + (AUDIO_BLOCK_SIZE*5))
#define AUDIO_POST  		(AUDIO_REC_START_ADDR + (AUDIO_BLOCK_SIZE*6))

// WAV File
#define Audio_freq 			AUDIO_FREQUENCY_16K
#define Audio_bit_res 		DEFAULT_AUDIO_IN_BIT_RESOLUTION
#define Audio_chan 			DEFAULT_AUDIO_IN_CHANNEL_NBR 	// A changer en mono
#define BytePerBloc			Audio_bit_res*Audio_chan/8
#define BytePerSec			BytePerBloc*Audio_freq

#define MASK_32_TO_8_0		0x000000FF
#define MASK_32_TO_8_1		0x0000FF00
#define MASK_32_TO_8_2		0x00FF0000
#define MASK_32_TO_8_3		0xFF000000

// Keyboard
#define MAJ					20
#define SPACE				32
#define BACKSPACE			8
#define ENTER				10

#define MAX_c 				30
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

DMA2D_HandleTypeDef hdma2d;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c3;

LTDC_HandleTypeDef hltdc;

SAI_HandleTypeDef hsai_BlockA2;
SAI_HandleTypeDef hsai_BlockB2;
DMA_HandleTypeDef hdma_sai2_a;
DMA_HandleTypeDef hdma_sai2_b;

SD_HandleTypeDef hsd1;
DMA_HandleTypeDef hdma_sdmmc1_rx;
DMA_HandleTypeDef hdma_sdmmc1_tx;

UART_HandleTypeDef huart1;

SDRAM_HandleTypeDef hsdram1;

osThreadId defaultTaskHandle;
osThreadId SDHandle;
osThreadId AudioHandle;
osThreadId inputHandle;
/* USER CODE BEGIN PV */
osThreadId KBHandle;
uint8_t workBuffer[2 * _MAX_SS];

uint32_t  audio_rec_buffer_state;

typedef enum
{
	BUFFER_OFFSET_NONE = 0,
	BUFFER_OFFSET_HALF = 1,
	BUFFER_OFFSET_FULL = 2,
}BUFFER_StateTypeDef;

uint8_t keyboard[5][10] =	{
							{'1','2','3','4','5','6','7','8','9','0'},
							{'a','z','e','r','t','y','u','i','o','p'},
							{'q','s','d','f','g','h','j','k','l','m'},
							{0,0,'w','x','c','v','b','n',BACKSPACE,BACKSPACE},
							{MAJ,MAJ,0,SPACE,SPACE,SPACE,SPACE,0,ENTER,ENTER}
							};

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_SDMMC1_SD_Init(void);
static void MX_FMC_Init(void);
static void MX_LTDC_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_DMA2D_Init(void);
static void MX_SAI2_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C3_Init(void);
void StartDefaultTask(void const * argument);
void SDTask(void const * argument);
void AudioTask(void const * argument);
void InputTask(void const * argument);

/* USER CODE BEGIN PFP */
void write_header(uint32_t N_Bytes_Data);
void KeyboardTask(void const * argument);

void RL_sep(uint16_t* buffer, uint16_t size){
	uint16_t j=0,k=0;
	for(size_t i=0;i<size;i++){
		if(i%2){
			((uint16_t*)AUDIO_BUFFER_R)[j] = buffer[i];
			j++;
		}else{
			((uint16_t*)AUDIO_BUFFER_L)[k] = buffer[i];
			k++;
		}
	}
}

void RL_cat(uint16_t* buffer, uint16_t size){
	uint16_t j=0,k=0;
	for(size_t i=0;i<size;i++){
		if(i%2){
			buffer[i]=((uint16_t*)AUDIO_BUFFER_R)[j];
			j++;
		}
		else{
			buffer[i] = ((uint16_t*)AUDIO_BUFFER_L)[k];
			k++;
		}
	}
}

void treatment(){
	for(size_t i=0;i<AUDIO_BLOCK_SIZE/2;i++){
		((uint16_t*)AUDIO_POST)[i] = ((uint16_t*)AUDIO_BUFFER_L)[i] + ((uint16_t*)AUDIO_BUFFER_R)[i];
	}
}

void RL_cat2(uint16_t* buffer, uint16_t size){
	uint16_t j=0,k=0;
	for(size_t i=0;i<size;i++){
		if(i%2){
			buffer[i]=((uint16_t*)AUDIO_POST)[j];
			j++;
		}
		else{
			buffer[i] = ((uint16_t*)AUDIO_POST)[k];
			k++;
		}
	}
}
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
	uint8_t status = 0;
  /* USER CODE END 1 */

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

