hiGepi/STM32F746G-Voice_recorder/Voice_recorder/Core/Src/main.c
  /*Configure GPIO pins : RMII_MDC_Pin RMII_RXD0_Pin RMII_RXD1_Pin */
  GPIO_InitStruct.Pin = RMII_MDC_Pin|RMII_RXD0_Pin|RMII_RXD1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pin : PB2 */
  GPIO_InitStruct.Pin = GPIO_PIN_2;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF9_QUADSPI;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pins : QSPI_D1_Pin QSPI_D3_Pin QSPI_D0_Pin */
  GPIO_InitStruct.Pin = QSPI_D1_Pin|QSPI_D3_Pin|QSPI_D0_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF9_QUADSPI;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pin : RMII_RXER_Pin */
  GPIO_InitStruct.Pin = RMII_RXER_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(RMII_RXER_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : RMII_REF_CLK_Pin RMII_MDIO_Pin RMII_CRS_DV_Pin */
  GPIO_InitStruct.Pin = RMII_REF_CLK_Pin|RMII_MDIO_Pin|RMII_CRS_DV_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pin : ARDUINO_A0_Pin */
  GPIO_InitStruct.Pin = ARDUINO_A0_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(ARDUINO_A0_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : DCMI_HSYNC_Pin PA6 */
  GPIO_InitStruct.Pin = DCMI_HSYNC_Pin|GPIO_PIN_6;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF13_DCMI;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_CLK_Pin ULPI_D0_Pin */
  GPIO_InitStruct.Pin = ULPI_CLK_Pin|ULPI_D0_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : ARDUINO_MISO_D12_Pin ARDUINO_MOSI_PWM_D11_Pin */
  GPIO_InitStruct.Pin = ARDUINO_MISO_D12_Pin|ARDUINO_MOSI_PWM_D11_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */
void BSP_AUDIO_IN_TransferComplete_CallBack(void)
{
	audio_rec_buffer_state = BUFFER_OFFSET_FULL;
	return;
}

void BSP_AUDIO_IN_HalfTransfer_CallBack(void)
{
	audio_rec_buffer_state = BUFFER_OFFSET_HALF;
	return;
}

void write_header(uint32_t N_Bytes_Data){
	uint32_t byteswritten;
	uint8_t entete[] = { 0x52, 0x49, 0x46,
			0x46, //'RIFF' : identification du format
			(uint8_t) ((N_Bytes_Data+36) & MASK_32_TO_8_0),
			(uint8_t) (((N_Bytes_Data+36) & MASK_32_TO_8_1)>>8),
			(uint8_t) (((N_Bytes_Data+36) & MASK_32_TO_8_2)>>16),
			(uint8_t) (((N_Bytes_Data+36) & MASK_32_TO_8_3)>>24), //Taille du fichier - 8 octets (en octets)

			0x57, 0x41, 0x56,
			0x45, //'WAVE'
			0x66, 0x6D, 0x74,
			0x20, //'fmt ' identifiant le format WAV
			0x10, 0x00, 0x00,
			0x00, //Nombre d'octets utilisés pour définir le format (16)
			0x01,
			0x00, //Pas de compression, format PCM entier
			Audio_chan,
			0x00, //Nombre de cannaux
			(uint8_t) (Audio_freq & MASK_32_TO_8_0),
			(uint8_t) ((Audio_freq & MASK_32_TO_8_1)>>8),
			(uint8_t) ((Audio_freq & MASK_32_TO_8_2)>>16),
			(uint8_t) ((Audio_freq & MASK_32_TO_8_3)>>24), //Fréquence d'échantillonnage

			(uint8_t) (BytePerSec & MASK_32_TO_8_0),
			(uint8_t) ((BytePerSec & MASK_32_TO_8_1)>>8),
			(uint8_t) ((BytePerSec & MASK_32_TO_8_2)>>16),
			(uint8_t) ((BytePerSec & MASK_32_TO_8_3)>>24), //Nombre d'octets par seconde

			(BytePerBloc & MASK_32_TO_8_0), ((BytePerBloc & MASK_32_TO_8_1)<<8), //BytePerBloc

			(Audio_bit_res), 0x00, //Bits par échantillons (ici 16 par défaut)
			0x64, 0x61, 0x74, 0x61, //'DATA'
			//(DataSize & MASK_32_TO_8_0), (DataSize & MASK_32_TO_8_1), (DataSize& MASK_32_TO_8_2), (DataSize & MASK_32_TO_8_3)
			(uint8_t) ((N_Bytes_Data) & MASK_32_TO_8_0),
			(uint8_t) (((N_Bytes_Data) & MASK_32_TO_8_1)>>8),
			(uint8_t) (((N_Bytes_Data) & MASK_32_TO_8_2)>>16),
			(uint8_t) (((N_Bytes_Data) & MASK_32_TO_8_3)>>24),//DataSize
	};
	f_write(&SDFile, entete, 44, (void*) &byteswritten);
}

/* USER CODE BEGIN Header_KeyboardTask */
/**
* @brief Function implementing the KB thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_KeyboardTask */
void KeyboardTask(void const * argument)
{
  /* USER CODE BEGIN KeyboardTask */
  /* Infinite loop */
  for(;;)
  {
    osDelay(100);
  }
  /* USER CODE END KeyboardTask */
}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
 * @brief  Function implementing the defaultTask thread.
 * @param  argument: Not used
 * @retval None
 */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{
  /* USER CODE BEGIN 5 */
	/* Infinite loop */
	for(;;)
	{
		osDelay(1);
	}
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_SDTask */
/**
 * @brief Function implementing the SD thread.
 * @param argument: Not used
 * @retval None
 */
/* USER CODE END Header_SDTask */
void SDTask(void const * argument)
{
  /* USER CODE BEGIN SDTask */
//	FRESULT res; /* FatFs function common result code */
//	uint32_t byteswritten; /* File write/read counts */
//	uint8_t wtext[] = "La version v1.16.1 ne devrait plus poser de soucis :)"; /* File write buffer */
//	uint8_t rtext[_MAX_SS];/* File read buffer */
//	if(f_mount(&SDFatFS, (TCHAR const*)SDPath, 0) != FR_OK)
//	{
//		Error_Handler();
//	}
//	else
//	{
//		if(f_mkfs((TCHAR const*)SDPath, FM_ANY, 0, rtext, sizeof(rtext)) != FR_OK)
//		{
//			Error_Handler();
//		}
//		else
//		{
//			//Open file for writing (Create)
//			if(f_open(&SDFile, "EEA.TXT", FA_CREATE_ALWAYS | FA_WRITE) != FR_OK)
//			{
//				Error_Handler();
//			}
//			else
//			{
//				//Write to the text file
//				res = f_write(&SDFile, wtext, strlen((char *)wtext), (void *)&byteswritten);
//				if((byteswritten == 0) || (res != FR_OK))
//				{
//					Error_Handler();
//				}
//				else
//				{
//					f_close(&SDFile);
//				}
//			}
//		}
//	}
//	f_mount(&SDFatFS, (TCHAR const*)NULL, 0);
	/* Infinite loop */
	for(;;)
	{
		osDelay(1000);
	}
  /* USER CODE END SDTask */
}

/* USER CODE BEGIN Header_AudioTask */
/**
* @brief Function implementing the Audio thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_AudioTask */
void AudioTask(void const * argument)
{
  /* USER CODE BEGIN AudioTask */
	if (BSP_AUDIO_IN_OUT_Init(INPUT_DEVICE_DIGITAL_MICROPHONE_2, OUTPUT_DEVICE_HEADPHONE, 16000, DEFAULT_AUDIO_IN_BIT_RESOLUTION, DEFAULT_AUDIO_IN_CHANNEL_NBR) == AUDIO_OK)
	{
		BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
		BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
		BSP_LCD_DisplayStringAt(0, BSP_LCD_GetYSize() - 90, (uint8_t *)"  AUDIO RECORD INIT OK  ", CENTER_MODE);
	}

	/* Initialize SDRAM buffers */
//	memset((uint16_t*)AUDIO_BUFFER_IN, 0, AUDIO_BLOCK_SIZE*2);
//	memset((uint16_t*)AUDIO_BUFFER_OUT, 0, AUDIO_BLOCK_SIZE*2);
//	audio_rec_buffer_state = BUFFER_OFFSET_NONE;
//
//	/* Start Recording */
//	BSP_AUDIO_IN_Record((uint16_t*)AUDIO_BUFFER_IN, AUDIO_BLOCK_SIZE);
//	BSP_AUDIO_IN_SetVolume(90);
//	/* Start Playback */
//	BSP_AUDIO_OUT_SetAudioFrameSlot(CODEC_AUDIOFRAME_SLOT_02);
//	BSP_AUDIO_OUT_Play((uint16_t*)AUDIO_BUFFER_OUT, AUDIO_BLOCK_SIZE*2);
	/* Infinite loop */
	for(;;)
	{
//		while(audio_rec_buffer_state != BUFFER_OFFSET_HALF);
//		RL_sep((uint16_t*)AUDIO_BUFFER_IN,AUDIO_BLOCK_SIZE);
//		treatment();
//		RL_cat2((uint16_t*)AUDIO_BUFFER_OUT,AUDIO_BLOCK_SIZE);
//		while(audio_rec_buffer_state != BUFFER_OFFSET_FULL);
//		RL_sep((uint16_t*)(AUDIO_BUFFER_IN+(AUDIO_BLOCK_SIZE)),AUDIO_BLOCK_SIZE);
//		treatment();
//		RL_cat2((uint16_t*)(AUDIO_BUFFER_OUT+(AUDIO_BLOCK_SIZE)),AUDIO_BLOCK_SIZE);
		osDelay(100);
	}
  /* USER CODE END AudioTask */
}

/* USER CODE BEGIN Header_InputTask */
/**
* @brief Function implementing the input thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_InputTask */
void InputTask(void const * argument)
{
  /* USER CODE BEGIN InputTask */
	uint16_t x = 20;
	uint16_t y = 20;
	uint16_t Width = MAX_c*7;
	uint16_t Height = 12;

	BSP_LCD_SetTextColor(0xFFEEEEEE);
	BSP_LCD_FillRect(x+6*7, y, x+Width-6*7, Height);
	BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
	uint8_t text[50] = "Name : ";
	BSP_LCD_DisplayStringAt(x, y, text, LEFT_MODE);

	TS_StateTypeDef  prev_state;
	TS_StateTypeDef TS_State;

	uint8_t state = 0;

