hiGepi/STM32F746G-Voice_recorder/Voice_recorder/Core/Src/main.c
	/* Infinite loop */
	for(;;)
	{
		BSP_TS_GetState(&TS_State);
		if(TS_State.touchDetected != prev_state.touchDetected && TS_State.touchDetected < 2){
			prev_state.touchDetected = TS_State.touchDetected;
			switch (state){
				case 0:
					if(TS_State.touchX[0] >= x && TS_State.touchX[0] <= x+Width &&
						TS_State.touchY[0] >= y-10 && TS_State.touchY[0] <= y+Height+10){
						state = 1;
					}
					break;

				case 1:
					if(TS_State.touchX[0] >= x && TS_State.touchX[0] <= x+Width &&
							TS_State.touchY[0] >= y-10 && TS_State.touchY[0] <= y+Height+10){
						state = 0;
						HAL_GPIO_TogglePin(LED2_GPIO_Port, LED2_Pin);
						/* definition and creation of KB */
						osThreadDef(KB, KeyboardTask, osPriorityNormal, 0, 2048);
						KBHandle = osThreadCreate(osThread(KB), NULL);

					} else state = 0;
					break;

				default:
					state = 0;
					break;
			}
		}
		osDelay(100);
	}
  /* USER CODE END InputTask */
}

 /**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	__disable_irq();
	BSP_LCD_SetTextColor(LCD_COLOR_RED);
	BSP_LCD_DisplayStringAt(0, 130, (uint8_t *)"ERREUR!", CENTER_MODE);
	while (1)
	{
	}
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
	/* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
